[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:20:24
 
   const navigate = useNavigate();
 
-  const testIdPrefix = "RecommendationRequestForm";
+  const testIdPrefix = "";
 
   return (
killedBy: RecommendationRequestForm tests renders correctly when passing in initialContents
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:61:42
           id="professorEmail"
           type="email"
           isInvalid={Boolean(errors.professorEmail)}
-          {...register("professorEmail", {
-            required: "Professor Email is required.",
-          })}
+          {...register("professorEmail", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Professor Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:93:41
           id="dateRequested"
           type="datetime-local"
           isInvalid={Boolean(errors.dateRequested)}
-          {...register("dateRequested", {
-            required: "Date Requested is required.",
-          })}
+          {...register("dateRequested", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Date Requested is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:105:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="dateNeeded">Date Needed</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "-dateNeeded"}
+          data-testid={testIdPrefix + ""}
           id="dateNeeded"
           type="datetime-local"
killedBy: RecommendationRequestForm tests renders all form fields with correct test ids
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-dateNeeded"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:109:38
           id="dateNeeded"
           type="datetime-local"
           isInvalid={Boolean(errors.dateNeeded)}
-          {...register("dateNeeded", {
-            required: "Date Needed is required.",
-          })}
+          {...register("dateNeeded", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Date Needed is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
