[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:39:20
   const columns = [
     {
       header: "id",
-      accessorKey: "id",
+      accessorKey: "",
     },
     {
killedBy: RecommendationRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:58:15
       accessorKey: "dateRequested",
     },
     {
-      header: "Date Needed",
+      header: "",
       accessorKey: "dateNeeded",
     },
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Date Needed. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestTable"
