[Killed] BlockStatement
src/main/utils/recommendationRequestUtils.js:10:47
   toast("RecommendationRequest deleted successfully");
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    // Stryker disable next-line all
-    url: "/api/recommendationrequest",
-    method: "DELETE",
-    params: {
-      id: cell.row.original.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: RecommendationRequestTable tests Delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table
