[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.jsx:34:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid={`${testIdPrefix}-id`}
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {true}
       </Row>
 
killedBy: ArticlesForm tests renders correctly when passing in initialContents
statusReason: Unable to find an element by: [data-testid="ArticlesForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Articles/ArticlesForm.jsx:56:28
           <Form.Group className="mb-3">
             <Form.Label htmlFor="title">Title</Form.Label>
             <Form.Control
-              data-testid={`${testIdPrefix}-title`}
+              data-testid={``}
               id="title"
               type="text"
killedBy: ArticlesForm tests no errors on good input, submitAction is called
statusReason: Unable to find an element by: [data-testid="ArticlesForm-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Articles/ArticlesForm.jsx:76:28
           <Form.Group className="mb-3">
             <Form.Label htmlFor="url">URL</Form.Label>
             <Form.Control
-              data-testid={`${testIdPrefix}-url`}
+              data-testid={``}
               id="url"
               type="text"
killedBy: ArticlesForm tests no errors on good input, submitAction is called
statusReason: Unable to find an element by: [data-testid="ArticlesForm-url"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.jsx:144:41
               id="dateAdded"
               type="text"
               isInvalid={Boolean(errors.dateAdded)}
-              {...register("dateAdded", {
-                required: "Date Added is required.",
-                pattern: {
-                  value: isodate_regex,
-                  message: "Date Added must be in ISO format.",
-                },
-              })}
+              {...register("dateAdded", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests shows correct validation errors on missing input
statusReason: Unable to find an element with the text: /Date Added is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.jsx:146:26
               isInvalid={Boolean(errors.dateAdded)}
               {...register("dateAdded", {
                 required: "Date Added is required.",
-                pattern: {
-                  value: isodate_regex,
-                  message: "Date Added must be in ISO format.",
-                },
+                pattern: {},
               })}
             />
killedBy: ArticlesForm tests shows correct validation error on bad date input
statusReason: Unable to find an element with the text: /Date Added must be in ISO format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
