[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.jsx:54:28
                 required: "Requester email is required.",
                 pattern: {
                   value: emailRegex,
-                  message: "Requester email must be a valid email address.",
+                  message: "",
                 },
               })}
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Requester email must be a valid email address./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.jsx:72:27
               type="text"
               isInvalid={Boolean(errors.teamId)}
               {...register("teamId", {
-                required: "Team id is required.",
+                required: "",
               })}
             />
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Team id is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.jsx:143:24
           id="solved"
           type="checkbox"
           label="Solved"
-          {...register("solved")}
+          {...register("")}
         />
       </Form.Group>
killedBy: HelpRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading '_f')
