[Killed] BlockStatement
main/components/HelpRequest/HelpRequestTable.jsx:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/helprequest/edit/${cell.row.original.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: HelpRequestTable tests Edit button navigates to the edit page
statusReason: expected "vi.fn()" to be called with arguments: [ '/helprequest/edit/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />
