[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewTable.jsx:44:15
     },
 
     {
-      header: "ItemId",
+      header: "",
       accessorKey: "itemId",
     },
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: Unable to find an element with the text: ItemId. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="MenuItemReviewTable"
