[Killed] ConditionalExpression
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:26:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="UCSBDiningCommonsMenuItemForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {false}
 
         <Col>
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly when passing in a UCSBDiningCommonsMenuItem
statusReason: Unable to find an element by: [data-testid="/UCSBDiningCommonsMenuItemForm-id/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:53:27
               type="text"
               isInvalid={Boolean(errors.diningCommonsCode)}
               {...register("diningCommonsCode", {
-                required: true,
+                required: false,
               })}
             />
killedBy: UCSBDiningCommonsMenuItemForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Dining Commons Code is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:57:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.diningCommonsCode && "Dining Commons Code is required. "}
+              {errors.diningCommonsCode || "Dining Commons Code is required. "}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly
statusReason: Found multiple elements with the text: /Dining Commons Code/

Here are the matching elements:

Ignored nodes: comments, script, style
<label
  class="form-label"
  for="diningCommonsCode"

[Killed] ConditionalExpression
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:57:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.diningCommonsCode && "Dining Commons Code is required. "}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBDiningCommonsMenuItemForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Dining Commons Code is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:70:27
               type="text"
               isInvalid={Boolean(errors.station)}
               {...register("station", {
-                required: true,
+                required: false,
               })}
             />
killedBy: UCSBDiningCommonsMenuItemForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Station is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:74:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.station && "Station is required. "}
+              {errors.station || "Station is required. "}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBDiningCommonsMenuItemForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Dining Commons Code is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:74:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.station && "Station is required. "}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBDiningCommonsMenuItemForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Station is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
