[Killed] BlockStatement
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.jsx:15:34
 export default function UCSBDiningCommonsMenuItemTable({ items, currentUser }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/diningcommonsmenuitem/edit/${cell.row.original.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: expected "vi.fn()" to be called with arguments: [ '/diningcommonsmenuitem/edit/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.jsx:16:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/diningcommonsmenuitem/edit/${cell.row.original.id}`);
+    navigate(``);
   };
 
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: expected "vi.fn()" to be called with arguments: [ '/diningcommonsmenuitem/edit/1' ]

Received: 

  1st vi.fn() call:

  [
-   "/diningcommonsmenuitem/edit/1",

[Killed] ArrayDeclaration
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.jsx:33:19
     deleteMutation.mutate(cell);
   };
 
-  const columns = [
-    {
-      header: "id",
-      accessorKey: "id", // accessor is the "key" in the data
-    },
-    {
-      header: "Dining Commons Code",
-      accessorKey: "diningCommonsCode",
-    },
-    {
-      header: "Name",
-      accessorKey: "name",
-    },
-    {
-      header: "Station",
-      accessorKey: "station",
-    },
-  ];
+  const columns = [];
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: UCSBDiningCommonsMenuItemIndexPage tests renders three menu items correctly for regular user
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.jsx:44:20
     },
     {
       header: "Name",
-      accessorKey: "name",
+      accessorKey: "",
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemTable-cell-row-0-col-name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBDiningCommonsMenuItemTable"

[Killed] BlockStatement
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.jsx:52:43
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(
-      ButtonColumn(
-        "Edit",
-        "primary",
-        editCallback,
-        "UCSBDiningCommonsMenuItemTable",
-      ),
-    );
-    columns.push(
-      ButtonColumn(
-        "Delete",
-        "danger",
-        deleteCallback,
-        "UCSBDiningCommonsMenuItemTable",
-      ),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return (
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBDiningCommonsMenuItemTable"
