[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:24:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="orgCode">Organization Code</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "-orgCode"}
-            id="orgCode"
-            type="text"
-            {...register("orgCode")}
-            value={initialContents.orgCode}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {false}
 
       {!initialContents && (
killedBy: UCSBOrganizationForm tests renders correctly when passing in initialContents
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:24:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="orgCode">Organization Code</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "-orgCode"}
-            id="orgCode"
-            type="text"
-            {...register("orgCode")}
-            value={initialContents.orgCode}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {initialContents || <Form.Group className="mb-3">
+          <Form.Label htmlFor="orgCode">Organization Code</Form.Label>
+          <Form.Control data-testid={testIdPrefix + "-orgCode"} id="orgCode" type="text" {...register("orgCode")} value={initialContents.orgCode} disabled />
+        </Form.Group>}
 
       {!initialContents && (
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'orgCode')

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:38:8
         </Form.Group>
       )}
 
-      {!initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="orgCode">Organization Code</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "-orgCode"}
-            id="orgCode"
-            type="text"
-            isInvalid={Boolean(errors.orgCode)}
-            {...register("orgCode", {
-              required: "Organization code is required.",
-              maxLength: {
-                value: 30,
-                message: "Max length 30 characters",
-              },
-            })}
-          />
-          <Form.Control.Feedback type="invalid">
-            {errors.orgCode?.message}
-          </Form.Control.Feedback>
-        </Form.Group>
-      )}
+      {true}
 
       <Form.Group className="mb-3">
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: Unable to find an element with the text: Organization Code. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:38:8
         </Form.Group>
       )}
 
-      {!initialContents && (
+      {initialContents && (
         <Form.Group className="mb-3">
           <Form.Label htmlFor="orgCode">Organization Code</Form.Label>
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: Unable to find an element with the text: Organization Code. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:46:37
             id="orgCode"
             type="text"
             isInvalid={Boolean(errors.orgCode)}
-            {...register("orgCode", {
-              required: "Organization code is required.",
-              maxLength: {
-                value: 30,
-                message: "Max length 30 characters",
-              },
-            })}
+            {...register("orgCode", {})}
           />
           <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Organization code is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:69:47
           id="orgTranslationShort"
           type="text"
           isInvalid={Boolean(errors.orgTranslationShort)}
-          {...register("orgTranslationShort", {
-            required: "Organization short name is required.",
-          })}
+          {...register("orgTranslationShort", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Organization short name is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
