[Killed] ArrowFunction
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:19:35
     navigate(`/ucsborganization/edit/${cell.row.original.orgCode}`);
   };
 
-  const cellToAxiosParamsDelete = (cell) => ({
-    url: "/api/ucsborganization",
-    method: "DELETE",
-    params: {
-      orgCode: cell.row.original.orgCode,
-    },
-  });
+  const cellToAxiosParamsDelete = () => undefined;
 
   const onDeleteSuccess = (message) => {
killedBy: UCSBOrganizationTable tests Delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:22:13
   const cellToAxiosParamsDelete = (cell) => ({
     url: "/api/ucsborganization",
     method: "DELETE",
-    params: {
-      orgCode: cell.row.original.orgCode,
-    },
+    params: {},
   });
 
killedBy: UCSBOrganizationTable tests Delete button calls delete callback
statusReason: expected {} to deeply equal { orgCode: 'ACM' }

[Killed] BlockStatement
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:27:40
     },
   });
 
-  const onDeleteSuccess = (message) => {
-    console.log(message);
-    toast(message);
-  };
+  const onDeleteSuccess = (message) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UCSBOrganizationTable tests Delete button calls delete callback
statusReason: expected "vi.fn()" to be called with arguments: [ { message: 'Organization deleted' } ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:51:15
       accessorKey: "orgCode",
     },
     {
-      header: "Short Name",
+      header: "",
       accessorKey: "orgTranslationShort",
     },
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Short Name. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:54:5
       header: "Short Name",
       accessorKey: "orgTranslationShort",
     },
-    {
-      header: "Organization Name",
-      accessorKey: "orgTranslation",
-    },
+    {},
     {
       header: "Inactive",
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:55:15
       accessorKey: "orgTranslationShort",
     },
     {
-      header: "Organization Name",
+      header: "",
       accessorKey: "orgTranslation",
     },
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Organization Name. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"
