[Killed] LogicalOperator
main/pages/Articles/ArticlesEditPage.jsx:68:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Article</h1>
-        {article && (
-          <ArticlesForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={article}
-          />
-        )}
+        {article || <ArticlesForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={article} />}
       </div>
     </BasicLayout>
killedBy: ArticlesEditPage tests when the backend doesn't return data renders header but form is not present
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input
  class="form-control"
  data-testid="ArticlesForm-title"
  id="title"
  name="title"
  type="text"

[Killed] ConditionalExpression
main/pages/Articles/ArticlesEditPage.jsx:68:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Article</h1>
-        {article && (
-          <ArticlesForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={article}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: ArticlesEditPage tests tests where backend is working normally is populated with the data provided
statusReason: Unable to find an element by: [data-testid="ArticlesForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
