[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestCreatePage.jsx:21:38
     },
   });
 
-  const onSuccess = (helpRequest) => {
-    toast(
-      `New HelpRequest Created - id: ${helpRequest.id} email: ${helpRequest.requesterEmail}`,
-    );
-  };
+  const onSuccess = (helpRequest) => {};
 
   const mutation = useBackendMutation(objectToAxiosParams, { onSuccess }, [
killedBy: HelpRequestCreatePage tests on submit, makes request to backend, and redirects to /helprequest
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestCreatePage.jsx:37:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/helprequest" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: HelpRequestCreatePage tests on submit, makes request to backend, and redirects to /helprequest
statusReason: expected "vi.fn()" to be called with arguments: [ { to: '/helprequest' } ]

Number of calls: 0
