[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestEditPage.jsx:43:38
     },
   });
 
-  const onSuccess = (helpRequest) => {
-    toast(
-      `HelpRequest Updated - id: ${helpRequest.id} email: ${helpRequest.requesterEmail}`,
-    );
-  };
+  const onSuccess = (helpRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestEditPage tests tests where backend is working normally changes when you click update
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] StringLiteral
main/pages/HelpRequest/HelpRequestEditPage.jsx:45:7
 
   const onSuccess = (helpRequest) => {
     toast(
-      `HelpRequest Updated - id: ${helpRequest.id} email: ${helpRequest.requesterEmail}`,
+      ``,
     );
   };
killedBy: HelpRequestEditPage tests tests where backend is working normally changes when you click update
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "HelpRequest Updated - id: 17 email: updated@ucsb.edu",
