[Killed] StringLiteral
main/pages/HelpRequest/HelpRequestIndexPage.jsx:18:27
         <Button
           variant="primary"
           href="/helprequest/create"
-          style={{ float: "right" }}
+          style={{ float: "" }}
         >
           Create HelpRequest
killedBy: HelpRequestIndexPage tests renders with Create Button for admin user
statusReason: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null

[Killed] ArrayDeclaration
main/pages/HelpRequest/HelpRequestIndexPage.jsx:31:5
     error: _error,
     status: _status,
   } = useBackend(
-    ["/api/helprequests/all"],
+    [],
     { method: "GET", url: "/api/helprequests/all" },
     [],
killedBy: HelpRequestIndexPage tests calls useBackend with the expected cache key, request, and default value
statusReason: expected "useBackend" to be called with arguments: [ [ '/api/helprequests/all' ], …(2) ]

Received: 

  1st useBackend call:

@@ -1,9 +1,7 @@
  [

[Killed] StringLiteral
main/pages/HelpRequest/HelpRequestIndexPage.jsx:31:6
     error: _error,
     status: _status,
   } = useBackend(
-    ["/api/helprequests/all"],
+    [""],
     { method: "GET", url: "/api/helprequests/all" },
     [],
killedBy: HelpRequestIndexPage tests calls useBackend with the expected cache key, request, and default value
statusReason: expected "useBackend" to be called with arguments: [ [ '/api/helprequests/all' ], …(2) ]

Received: 

  1st useBackend call:

@@ -1,8 +1,8 @@
  [

[Killed] StringLiteral
main/pages/HelpRequest/HelpRequestIndexPage.jsx:32:15
     status: _status,
   } = useBackend(
     ["/api/helprequests/all"],
-    { method: "GET", url: "/api/helprequests/all" },
+    { method: "", url: "/api/helprequests/all" },
     [],
   );
killedBy: HelpRequestIndexPage tests renders empty table when backend unavailable, user only
statusReason: expected 'Error communicating with backend via …' to match 'Error communicating with backend via …'
