[Killed] BlockStatement
main/pages/MenuItemReviews/MenuItemReviewsCreatePage.jsx:20:41
     },
   });
 
-  const onSuccess = (menuItemReview) => {
-    toast(
-      `New menuItemReview Created - id: ${menuItemReview.id} comments: ${menuItemReview.comments}`,
-    );
-  };
+  const onSuccess = (menuItemReview) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewsCreatePage tests on submit, makes request to backend, and redirects to /menuitemreviews
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0
