[Killed] ArrowFunction
main/pages/MenuItemReviews/MenuItemReviewsEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (menuItemReviews) => ({
-    url: "/api/menuitemreviews",
-    method: "PUT",
-    params: {
-      id: menuItemReviews.id,
-    },
-    data: {
-      itemId: menuItemReviews.itemId,
-      reviewerEmail: menuItemReviews.reviewerEmail,
-      stars: menuItemReviews.stars,
-      dateReviewed: menuItemReviews.dateReviewed,
-      comments: menuItemReviews.comments,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (menuItemReviews) => {
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "MenuItemReview Updated - id: 3 comments: Okay",

[Killed] ObjectLiteral
main/pages/MenuItemReviews/MenuItemReviewsEditPage.jsx:31:13
   const objectToAxiosPutParams = (menuItemReviews) => ({
     url: "/api/menuitemreviews",
     method: "PUT",
-    params: {
-      id: menuItemReviews.id,
-    },
+    params: {},
     data: {
       itemId: menuItemReviews.itemId,
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected {} to deeply equal { id: 3 }

[Killed] ObjectLiteral
main/pages/MenuItemReviews/MenuItemReviewsEditPage.jsx:34:11
     params: {
       id: menuItemReviews.id,
     },
-    data: {
-      itemId: menuItemReviews.itemId,
-      reviewerEmail: menuItemReviews.reviewerEmail,
-      stars: menuItemReviews.stars,
-      dateReviewed: menuItemReviews.dateReviewed,
-      comments: menuItemReviews.comments,
-    },
+    data: {},
   });
 
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected '{}' to be '{"itemId":4,"reviewerEmail":"johndoe@…' // Object.is equality

[Killed] BlockStatement
main/pages/MenuItemReviews/MenuItemReviewsEditPage.jsx:43:42
     },
   });
 
-  const onSuccess = (menuItemReviews) => {
-    toast(
-      `MenuItemReview Updated - id: ${menuItemReviews.id} comments: ${menuItemReviews.comments}`,
-    );
-  };
+  const onSuccess = (menuItemReviews) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] StringLiteral
main/pages/MenuItemReviews/MenuItemReviewsEditPage.jsx:45:7
 
   const onSuccess = (menuItemReviews) => {
     toast(
-      `MenuItemReview Updated - id: ${menuItemReviews.id} comments: ${menuItemReviews.comments}`,
+      ``,
     );
   };
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "MenuItemReview Updated - id: 3 comments: Okay",

[Killed] ConditionalExpression
main/pages/MenuItemReviews/MenuItemReviewsEditPage.jsx:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit MenuItemReview</h1>
-        {menuItemReviews && (
-          <MenuItemReviewForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={menuItemReviews}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/MenuItemReviews/MenuItemReviewsEditPage.jsx:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit MenuItemReview</h1>
-        {menuItemReviews && (
-          <MenuItemReviewForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={menuItemReviews}
-          />
-        )}
+        {menuItemReviews || <MenuItemReviewForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={menuItemReviews} />}
       </div>
     </BasicLayout>
killedBy: MenuItemReviewsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
