[Killed] ConditionalExpression
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:71:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit RecommendationRequest</h1>
-        {recommendationRequest && (
-          <RecommendationRequestForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={recommendationRequest}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
