[Killed] ObjectLiteral
main/pages/RecommendationRequest/RecommendationRequestIndexPage.jsx:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/recommendationrequests/all"],
-    { method: "GET", url: "/api/recommendationrequests/all" },
+    {},
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: RecommendationRequestIndexPage tests renders three recommendation requests correctly for regular user
statusReason: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
