[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.jsx:19:39
     },
   });
 
-  const onSuccess = (organization) => {
-    toast(
-      `New UCSBOrganization Created - orgCode: ${organization.orgCode} orgTranslationShort: ${organization.orgTranslationShort}`,
-    );
-  };
+  const onSuccess = (organization) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.jsx:21:7
 
   const onSuccess = (organization) => {
     toast(
-      `New UCSBOrganization Created - orgCode: ${organization.orgCode} orgTranslationShort: ${organization.orgTranslationShort}`,
+      ``,
     );
   };
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "New UCSBOrganization Created - orgCode: SBHACKS orgTranslationShort: SB Hacks",
