[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/ucsborganization?orgCode=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/ucsborganization`,
-      params: {
-        orgCode: id,
-      },
-    },
+    {},
   );
 
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:21:12
     {
       // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
       method: "GET",
-      url: `/api/ucsborganization`,
+      url: ``,
       params: {
         orgCode: id,
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:31:13
   const objectToAxiosPutParams = (organization) => ({
     url: "/api/ucsborganization",
     method: "PUT",
-    params: {
-      orgCode: organization.orgCode,
-    },
+    params: {},
     data: {
       orgCode: organization.orgCode,
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally changes when you click Update
statusReason: expected {} to deeply equal { orgCode: 'ACM' }

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:34:11
     params: {
       orgCode: organization.orgCode,
     },
-    data: {
-      orgCode: organization.orgCode,
-      orgTranslationShort: organization.orgTranslationShort,
-      orgTranslation: organization.orgTranslation,
-      inactive: organization.inactive,
-    },
+    data: {},
   });
 
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally changes when you click Update
statusReason: expected '{}' to be '{"orgCode":"ACM","orgTranslationShort…' // Object.is equality

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:42:39
     },
   });
 
-  const onSuccess = (organization) => {
-    toast(
-      `UCSBOrganization Updated - orgCode: ${organization.orgCode} orgTranslationShort: ${organization.orgTranslationShort}`,
-    );
-  };
+  const onSuccess = (organization) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally changes when you click Update
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:70:10
       <div className="pt-2">
         <h1>Edit UCSBOrganization</h1>
         <p className="visually-hidden">Edit page not yet implemented</p>
-        {organization && (
-          <UCSBOrganizationForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={organization}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:70:10
       <div className="pt-2">
         <h1>Edit UCSBOrganization</h1>
         <p className="visually-hidden">Edit page not yet implemented</p>
-        {organization && (
-          <UCSBOrganizationForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={organization}
-          />
-        )}
+        {organization || <UCSBOrganizationForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={organization} />}
       </div>
     </BasicLayout>
killedBy: UCSBOrganizationEditPage tests when the backend doesn't return data renders header but form is not present
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input
  class="form-control"
  data-testid="UCSBOrganizationForm-orgCode"
  id="orgCode"
  name="orgCode"
  type="text"
